tutorials/18UnsteadyBBTurb/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       205134;
    }
    outlet
    {
        type            patch;
        nFaces          166;
        startFace       205234;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          700;
        startFace       205400;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          566;
        startFace       206100;
    }
    lowerWallHeatFlux
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       206666;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          206000;
        startFace       206866;
    }
)

// ************************************************************************* //
